Revit 2026 API

# StairsEditScope Methods

---

The StairsEditScope type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | Cancels the edit scope. (Inherited from EditScope) |
|  | Commit | Finishes the edit scope. (Inherited from EditScope) |
|  | Dispose | (Inherited from EditScope) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Start(ElementId) | Starts an stairs edit mode for an existing Stairs element |
|  | Start(ElementId, ElementId) | Creates a new empty stairs element with a default stairs type in the specified levels and then starts stairs edit mode and editing the new stairs. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

StairsEditScope Class

Autodesk.Revit.DB Namespace